<?php
/**
 * 盛付通支付接口错误代码
 * Creator: xuho
 */

namespace App\Services\Pay;


class SftInfo
{
    // 盛付通支付 标识码与含义
    protected static $codeToMsg = [
        "B053080" => "商户订单号不能为空",
        "S0505006" => "没有对应该事件",
        "B0521201" => "不支持的签名类型",
        "B0505062" => "验证签名失败",
        "B0505002" => "产品授权验证失败",
        "B0532008" => "退款订单不存在",
        "B0532006" => "订单处理失败",
        "S0533001" => "系统接收异常",
        "S0533002" => "系统接收异常",
        "S0540001" => "网络繁忙，请稍后提交",
        "S0540002" => "网络繁忙，请稍后提交",
        "B0540101" => "提交过于频繁，请稍后提交",
        "B0540104" => "您输入的卡号密码错误，请重新输入",
        "B0540102" => "此卡不存在，请确认卡号输入正确",
        "B0540121" => "卡片状态已激活，卡片余额不足",
        "B0540103" => "卡状态异常",
        "B0540100" => "卡信息验证失败，请确认卡号信息是否正确",
        "B0540111" => "此卡状态异常（卡未激活），请联系购卡点处理",
        "B0540112" => "此卡状态异常（卡已被冻结），请联系购卡点处理",
        "B0540113" => "此卡状态异常（卡已作废），请联系购卡点处理",
        "B0540114" => "此卡禁止在当前平台消费，请转到【http://www.801335.com】",
        "B0540117" => "您的卡已过有效期，请联系盛付通客服人员申请延期后再使用",
        "B0540118" => "您的卡不能充值该应用，请联系购卡点",
        "B0540120" => "禁止消费商户",

        "S0533003" => "不支持的支付模式",
        "S0533008" => "tokenId不合法",
        "S0533009" => "支付超时",
        "S0533010" => "sessionID不能为空！",
        "S0533011" => "tokenId不能为空！",

        "B053001" => "商户号不正确",
        "B053002" => "定单类型不正确",
        "B053003" => "定单金额不正确",
        "B053004" => "用户未登录",
        "B053005" => "支付类型不正确",
        "B053006" => "支付机构编码为空",
        "B053007" => "支付工具不存在",
        "B053008" => "支付渠道不存在",
        "B053009" => "支付机构不存在",
        "B053010" => "组合支付策略配置信息有误！",
        "B053011" => "组合支付订单金额与应付金额不匹配！",


        "B0530012" => "商户订单号",
        "B0532534" => "订单不允许重复",
        "B053012" => "尚未设置支付密码",
        "B053013" => "支付密码已被锁定",
        "B0532433" => "支付密码输入错误",
        "B053014" => "会员账户尚未激活",
        "B053015" => "会员账户已被锁定",
        "B053016" => "会员账户不可用",
        "B053091" => "账户不存在",
        "B053017" => "CHECK_RENDER 失败",
        "B053018" => "登录类型为空",
        "B053019" => "用户名为空",
        "B053020" => "签名信息不存在",
        "B053021" => "签名信息错误",
        "B053022" => "登录密码为空",
        "B053023" => "用户名或者密码错误",
        "B053024" => "用户IP地址为空",
        "B053025" => "密保不正确",
        "B053026" => "密保卡不正确",
        "B053027" => "用户PT账号未找到",
        "B053028" => "登录用户与订单信息用户不匹配",
        "B053029" => "华友登录返回错误",
        "B053030" => "您还没有开通一点充，请通过绑定银行卡、手机轻松开通。",
        "B053040" => "请求参数不正确",
        "B053041" => "付款机构信息不正确",
        "B053042" => "网关交易号不正确",
        "B053043" => "应付金额不正确",
        "B053044" => "应付手续费不正确",
        "B053045" => "应收金额不正确",
        "B053046" => "应收手续费不正确",
        "B053047" => "付款用户IP不正确",
        "B053048" => "支付密码不正确",
        "B053049" => "卡信息不正确",
        "B053050" => "卡金额不正确",
        "B053051" => "充值卡卡号不正确",
        "B053052" => "充值卡卡密不正确",
        "B053053" => "签名密钥不正确",
        "B053054" => "银行卡信息不正确",
        "B053055" => "身份证号不正确",
        "B053056" => "用户姓名不正确",
        "B053057" => "证件类型不正确",
        "B053058" => "证件号码不正确",
        "B053059" => "有效期不正确",
        "B053060" => "CVV2不正确",
        "B053061" => "手机号不正确",
        "B053062" => "短信验证码不正确",
        "B053063" => "网银支付回调地址为空",
        "B053064" => "用户PT账号为空",
        "B053065" => "卡号或卡密不正确,此卡已过期或卡状态异常",

        "B053066" => "RSA加密随机KEY为空",
        "B053067" => "加密方式为空",
        "B053068" => "加密所使用的证书的序列号为空",
        "B053069" => "无可用的支付机构",
        "B053070" => "充值卡卡号长度不正确[10-19]位",
        "B053071" => "充值卡卡密长度不正确[8-21]位",
        "B053073" => "收单充值API统一接口暂不支持该种支付方式！",
        "B053074" => "订单已在支付处理中",
        "B053072" => "盛付通交易号不能为空",
        "B053081" => "订单时间格式错误",
        "B053082" => "货币类型错误",
        "B053083" => "订单号不存在",
        "S0505078" => "订单金额必须为整数",
        // 其他错误
        "A0513000" => "未知异常!",
        "A0513001" => "渠道未返回充值结果!",
        "A0513002" => "系统不支持该组卡型!",
        "A0513003" => "余额不足!",
        "A0513004" => "重复卡号!",
        "A0513005" => "组合不能超过三张卡!",
        "A0513006" => "卡账户金额为零!",
        "A0513007" => "卡账户已被锁定!",
        "A0513008" => "卡账户异常!",
        "A0513009" => "超过误差精度!",
        "A0513010" => "继续支付批次不存在!",
        "A0513011" => "继续支付批次与支付订单号不匹配!",
        "A0513012" => "继续支付失败",
        "A0513013" => "继续支付订单已过期",
        "B0513001" => "未找到定单支付记录!",
        "B0513002" => "未找到定单记录!",
        "B0513003" => "未知的事件操作!",
        "B0513004" => "未知的盛大卡支付子事件!",
        "B0513005" => "未知的盛大卡类型!",
        "B0513006" => "不支持多张卡同时支付!",
        "B0513007" => "订单金额必须整数元!",
        "B0513008" => "卡检查错误",
        "B0513009" => "卡余额不能小于1元",
        "B0513010" => "该卡不可用",
        "S0513000" => "卡支付系统异常!",
        "S0513001" => "支付指令不能为空!",
        "S0513003" => "修改订单金额失败!",
        "S0513004" => "保存结算请求记录失败!",
        "S0513005" => "签名失败!",
        "S0513002" => "设定不能为空!",
        "S0513007" => "不是代理类分账帐号!不支持的支付类型",
        "S0513008" => "CS 卡余额异常",
        "S0513009" => "Yabcd 卡余额异常",
        "S0513010" => "费用配置错误",
    ];
    // 默认标识码 含义
    protected static $default_msg = "未知错误";

    // 盛付通 支付 类型
    protected static $payChannel = [
        "wp" => ["payment_institution" => "WXZF", "mark" => "微信支付", "pay_type" => "PT312"],
        "ap" => ["payment_institution" => "ALZF", "mark" => "支付宝", "pay_type" => "PT312"],
        "ow" => ["payment_institution" => "OLWX", "mark" => "微信公众号", "pay_type" => "PT312"],
        "oa" => ["payment_institution" => "OLZF", "mark" => "支付宝服务窗", "pay_type" => "PT312"],
        "up" => ["payment_institution" => "UPZF", "mark" => "银联二维码", "pay_type" => "PT312"],
        "ux" => ["payment_institution" => "UPZF", "mark" => "银联条码", "pay_type" => "PT312"],
        "sj" => ["payment_institution" => "JDSA", "mark" => "京东扫码", "pay_type" => "PT312"],
        "sq" => ["payment_institution" => "QQSA", "mark" => "QQ扫码", "pay_type" => "PT312"],
        "hw" => ["payment_institution" => "H5WX", "mark" => "微信H5", "pay_type" => "PT312"],
        "ha" => ["payment_institution" => "H5WA", "mark" => "支付宝H5", "pay_type" => "PT312"],
    ];

    /**
     * 获取盛付通标识码码语义
     * @param int $code 状态码
     * @return mixed|string 返回字符串
     */
    public static function getPayChannel($code)
    {
        // 判断是否存在 状态码对应的语义
        if (!empty(self::$payChannel[$code])) {
            // 存在则返回
            $msg = self::$payChannel[$code];
        } else {
            // 不存在就返回默认的
            $msg = self::$default_msg;
        }
        return $msg;
    }

    /**
     * 获取盛付通标识码码语义
     * @param int $code 状态码
     * @return mixed|string 返回字符串
     */
    public static function getCodeToMsg($code)
    {
        // 判断是否存在 状态码对应的语义
        if (!empty(self::$codeToMsg[$code])) {
            // 存在则返回
            $msg = self::$codeToMsg[$code];
        } else {
            // 不存在就返回默认的
            $msg = self::$default_msg;
        }
        return $msg;
    }

}